Added new playbooks and updated inventory file for k3s setup
